Merge pull request #1 from ericsche/VS-Experience
Merging with latest fix
